; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	thermograph0 - mode
	infrared2 - mode
	star1 - direction
	star2 - direction
	star0 - direction
	planet3 - direction
	phenomenon4 - direction
	star5 - direction
	star6 - direction
	planet7 - direction
	planet8 - direction
	planet9 - direction
	planet10 - direction
	planet11 - direction
	phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 star0)
	(supports instrument1 image1)
	(calibration_target instrument1 star0)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet9)
)
(:goal (and
	(have_image planet3 infrared2)
	(have_image phenomenon4 thermograph0)
	(have_image star5 thermograph0)
	(have_image star6 image1)
	(have_image planet7 thermograph0)
	(have_image planet8 infrared2)
	(have_image planet9 infrared2)
	(have_image planet10 infrared2)
	(have_image planet11 image1)
	(have_image phenomenon12 image1)
))

)

; plan
1. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 10
5. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 10
6. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 10
7. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 10
8. (turn_to satellite0 phenomenon4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon4)
   goals met: 0 of 10
9. (take_image satellite0 phenomenon4 instrument2 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 1 of 10
10. (turn_to satellite0 phenomenon12 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 10
11. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 1 of 10
12. (take_image satellite0 planet10 instrument2 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 2 of 10
13. (turn_to satellite0 phenomenon12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 10
14. (turn_to satellite0 planet3 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet3)
   goals met: 2 of 10
15. (take_image satellite0 planet3 instrument2 infrared2)
   added: (have_image planet3 infrared2)
   goals met: 3 of 10
16. (turn_to satellite0 phenomenon12 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
17. (turn_to satellite0 planet7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet7)
   goals met: 3 of 10
18. (take_image satellite0 planet7 instrument2 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 4 of 10
19. (turn_to satellite0 phenomenon12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 10
20. (turn_to satellite0 planet8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet8)
   goals met: 4 of 10
21. (take_image satellite0 planet8 instrument2 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 5 of 10
22. (turn_to satellite0 phenomenon12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 10
23. (turn_to satellite0 planet9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet9)
   goals met: 5 of 10
24. (take_image satellite0 planet9 instrument2 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 6 of 10
25. (turn_to satellite0 phenomenon12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 10
26. (turn_to satellite0 star5 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star5)
   goals met: 6 of 10
27. (take_image satellite0 star5 instrument2 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 7 of 10
28. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 7 of 10
29. (turn_to satellite0 phenomenon12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon12)
   goals met: 7 of 10
30. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 10
31. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 7 of 10
32. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 7 of 10
33. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 7 of 10
34. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 8 of 10
35. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 8 of 10
36. (take_image satellite0 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 9 of 10
37. (turn_to satellite0 star6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star6)
   goals met: 9 of 10
38. (take_image satellite0 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 10 of 10
